---
kind: other
id: Properties.T:Autodesk.Revit.UI.DoubleClickOptions
source: html/0792fa04-c822-0b81-94cc-d572d1ff146e.htm
---
# DoubleClickOptions Properties

Specifies whether the .NET object represents a valid Revit entity.